OdDAI.OdDAIObjectSDAI.subViewportDraw(OdGiViewportDraw*)
\details
Draws the Standard Data Access Interface (SDAI) object that is dependent on the viewport context.
\param vd [in] A raw pointer to the object that encapsulates parameters of viewport-dependent vectorization.
\remarks
The default implementation is empty.

OdDAI.OdDAIObjectSDAI.subWorldDraw(OdGiWorldDraw*)
\details
Draws the graphical representation of the Standard Data Access Interface (SDAI) object that is independent of any viewport contexts.
\param wd [in] A raw pointer to the OdGiDrawable object that encapsulates parameters of view port independent vectorization.
\returns true if the drawing was successful; otherwise, the method returns false.

OdDAI.OdDAIObjectSDAI.subSetAttributes(OdGiDrawableTraits*)
\details
Sets the values of the Standard Data Access Interface (SDAI) object's subentity traits, and returns the object's subentity traits to the calling subroutine.
\param traits [in] A raw pointer to the OdGiDrawableTraits object to be set.
\returns A set of flags represented with an unsigned 32-bit integer value.
\remarks
When re-implementing this method, use the "or" bit operation (|) for the return value of the parent class' subSetAttributes() method and any flags you have added.
\sa
OdGiDrawableTraits class documentation.

OdDAI.OdDAIObjectSDAI.gsNode
\details
Retrieves the current Gs node object of the Standard Data Access Interface (SDAI) object.
\returns A raw pointer to the OdGsCache object associated with the SDAI object.

OdDAI.OdDAIObjectSDAI.setGsNode(OdGsCache*)
\details
Sets a new Gs node cache for the Standard Data Access Interface (SDAI) object.
\param pGsNode [in] A raw pointer to an OdGsCache object.

OdDAI.OdDAIObjectSDAI.id
\details
Retrieves the database object identifier of the Standard Data Access Interface (SDAI) object.
\returns The SDAI object's database identifier.
\remarks
The method returns a NULL pointer if the SDAI object is not persistent (i.e. not stored in a database).

OdDAI.OdDAIObjectSDAI.isPersistent
\details
Retrieves whether the Standard Data Access Interface (SDAI) object is a persistent one.
\returns true if the SDAI object is a persistent one; otherwise, the method returns false.
\remarks
Persistent objects are database-resident objects (i.e. they are stored in a database).

OdDAI.OdDAIObjectSDAI.testAttrCaseInsensitive(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the attribute value is set or is unset.
The specified attribute name is case-insensitive.
\param attrName [in] An ANSI string that contains the attribute's name.
\returns true if the attribute's value is set; otherwise, the method returns false (it means that the attribute's value is not set).

OdDAI.OdDAIObjectSDAI.testAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the attribute value is set or is unset.
\param attrName [in] An ANSI string that contains the attribute name.
\returns true if the attribute's value is set; otherwise, the method returns false (it means that the attribute's value is not set).

OdDAI.OdDAIObjectSDAI.isKindOf(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the Standard Data Access Interface (SDAI) object belongs to a certain entity type with a specified name.
\param entityName [in] A name of entities type.
\returns true if the SDAI object belongs to the type of entity with the specified name; otherwise, the method returns false.

OdDAI.OdDAIObjectSDAI.isInstanceOf(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the Standard Data Access Interface (SDAI) object is an instance of a specified instance type.
The instance type is specified with its name.
\param entityName [in] An ANSI string that contains the entity's type name.
\returns true if the SDAI object is an instance of the specified type; otherwise, the method returns false.

OdDAI.OdDAIObjectSDAI
\details
The base class for dictionary and application instances that can be manipulated with the Data Access Interface (DAI).